# basket.py
# Day 2: Introduction to Lists (Python Crash Course Chapter 3)

# --- 1. Create (สร้างตะกร้า) ---
# Type Hint: list[str] บอกว่าในนี้เก็บได้แค่ "ข้อความ"

products: list[str] = ["Mackbook Pro","Magic Mouse","Adapter"]

print(f"📦 เริ่มต้น: {products}")

# --- 2. Read (หยิบดูของ) ---
# คอมพิวเตอร์นับเริ่มที่ 0 เสมอ!
first_item = products[0]    # ตัวแรก
last_item = products[-1]    # ตัวสุดท้าย (เทคนิคลัด)

print(f"👉 ชิ้นแรก: {first_item}")
print(f"👉 ชิ้นท้าย: {last_item}")

# --- 3. Update (เปลี่ยนของ) ---
# เปลี่ยนใจไม่เอา Adapter จะเอา Trackpad แทน
print(f"🔄 เปลี่ยน:   {products[2]} -> Magic trackpad")
products[2] = "Magic Trackpad"
print(f"✅ อัปเดต: {products}")

# --- 4. Add (เพิ่มของ) ---
# append() = ต่อท้ายแถว (ลูกค้าหยิบของเพิ่ม)
products.append("Mechanical Keyboard")
print(f"➕ เพิ่มของ: {products}")

# --- 5. Delete (ลบของ) ---
# remove() = เอาของออกตามชื่อ (วางคืนชั้นวาง)
products.remove("Magic Mouse")
print(f"❌ ลบออก: {products}")

# นับจำนวนของที่เหลือ
count = len(products)
print(f"📊 คงเหลือ:  {count} รายการ")

print("-" * 30)
print("--- 📊 Organization Section ---")

# 1. การเรียงลำดับถาวร (Permanent Sort)
# เรียงตามตัวอักษร A -> Z (สังเกต: MacBook จะไปอยู่หลังสุดเพราะตัว M)
products.sort()
print(f"🔤 เรียง A-Z (ถาวร): {products}")

# 2. เรียงย้อนกลับ (Reverse Sort)
# เรียง Z -> A
products.sort(reverse=True)
print(f"🔠 เรียง Z-A (ถาวร): {products}")

# 3. การเรียงลำดับชั่วคราว (Temporary Sort)
# สมมติเรามีรายการราคา (ตัวเลข
prices : list[int]= [4500,1200,32000,900]

print(f"\n💰 ราคาเดิม: {prices}")
print(f"👀 ลองเรียงให้ดู:  {sorted(prices)}") # ใช้ sorted() ครอบ
print(f"💰 ราคาเดิมยังอยู่: {prices}")  # สังเกตว่าลิสต์ไม่เปลี่ยน!

# 4. กลับหัวหาง (Reverse Order)
# ไม่ได้เรียงมากไปน้อย แต่แค่ "กลับด้าน" (Flip) หัวไปหาง
products.reverse()
print(f"\n😃 กลับหัวรายการ: {products}")

# 5. สรุปยอดรวม (Length)
# สำคัญมาก! ใช้เวลาจะวนลูป หรือเช็คว่าของหมดหรือยัง
final_count = len(products)
print(f"\n🏁 สรุปมีสินค้า:  {final_count}")