"""
Workshop 3: Modules & Imports
Topic: การเรียกใช้ฟังก์ชันจากไฟล์อื่น (Separation of Concerns)
"""

# 🔥 พระเอกของวันนี้: การ Import ไฟล์ที่เราสร้างเอง
# แปลว่า: จากไฟล์ age_utils ให้ดึงฟังก์ชัน calculate_age และ check_generation มาใช้

from age_utils import calculate_age,check_generation

def main():
    print("--- 🧩 โปรแกรมวิเคราะห์ทีมงาน (Modular Version) ---")

    #ข้อมูลพนักงาน (จำลอง)
    team_data =[
        {"name": "Mac","year": 1995},
        {"name": "Pol","year": 2005},
        {"name": "Boss","year": 1980}
    ]

    for member in team_data:
        # เรียกใช้ฟังก์ชันจากอีกไฟล์ได้เลย เหมือนเขียนในไฟล์นี้!
        age = calculate_age(member["year"])
        gen = check_generation(member["year"])
        print(f"👤 {member['name']}: อายุ {age} ปี -> รุ่น {gen}")

# --- Entry Point ---
if __name__ == "__main__":
    main()